# Створіть 3 різних функції (на ваш вибір).
# Кожна з цих функцій повинна повертати якийсь результат.
# Також створіть четверту ф-цію, яка в тілі викликає 3 попередні, обробляє повернутий ними результат та також повертає результат.
# Таким чином ми будемо викликати 1 функцію, а вона в своєму тілі ще 3.

def func1(x):
    y1 = x + 1
    return y1

def func2(x):
    y2 = x + 2
    return y2
    
def func3(x):
    y3 = x + 3
    return y3

a = int(input('Введіть число: '))

def func4(x):
    x1 = func1(x)
    x2 = func1(x)
    x3 = func1(x)
    y4 = x1 + x2 + x3
    print('Результат: ')
    return y4
    
print(func4(a))   
